import url, { mailAgent, passwordAgent, mailKO, passwordKO } from './Url.cy.js';

import {
    generateRandomNumber,
    generateRandomExpression,
    getRandomDate,
    loginKO,
    login,
    CheckUchastie,
    CheckIspolnenieContrakta,
    CheckVozvratAvanca,
    CreateApplicaton,
    CheckGarantiynieObjazatelstva,
    DocumentsDifferentTypes,
    handleException
  } from "./Functoins";
  

  // Использование функций generateRandomNumber и generateRandomExpression
  let randomExpression = generateRandomExpression(20);
  let randomNum = generateRandomNumber(100000000000, 999999999999);
  let randomNumSum = generateRandomNumber(10000000, 99999999);
  let randomNumLot = generateRandomNumber(10, 99);

  describe("Автотесты", () => {

    it("Переходы Кредитный отдела", () => {
      loginKO();
      cy.on('uncaught:exception', (err, runnable) => {
        // Проверяем, является ли данная ошибка Assertion Error и если да, игнорируем ее
        if (err.message.includes('Expected to find content:')) {
            return false;
        }
    });
    
    cy.get(':nth-child(1) > div > div >.ant-row').eq(3).click();
    
    cy.get('body').then(($body) => {
        if ($body.find("Взять в работу").length > 0) {
            cy.contains("Взять в работу").click();
            cy.get('.ant-btn-primary').click();
        } else {
            cy.log("Элемент 'Взять в работу' не найден на странице.");
        }
    });
    cy.get('[class*="ApplicationCard_moduleTitleCardWrapper"]').contains('Чат').click()
    cy.get('#form_FooterChat_chatInputText').click().invoke('val', 'йцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщзхйцукенгшщ');
    cy.get('[class*="FooterChat_footerChatButtonMessage__Q8ZxD"] > .ant-btn').click();

      })
    });
